In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns 
import plotly.express as px

In [2]:
data=pd.read_csv('train.csv')
data.head(3)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               6019 non-null   object
 1   Location           6019 non-null   object
 2   Year               6019 non-null   int64
 3   Kilometers_Driven  6019 non-null   int64
 4   Fuel_Type          6019 non-null   object
 5   Transmission       6019 non-null   object
 6   Owner_Type         6019 non-null   object
 7   Mileage            6017 non-null   object
 8   Engine             5983 non-null   object
 9   Power              5983 non-null   object
 10  Seats              5977 non-null   float64
 11  New_Price          824 non-null    object
 12  Price              6019 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 611.4+ KB

In [4]:
data.describe()

              Year  Kilometers_Driven        Seats        Price
count  6019.000000       6.019000e+03  5977.000000  6019.000000
mean   2013.358199       5.873838e+04     5.278735     9.479468
std       3.269742       9.126884e+04     0.808840    11.187917
min    1998.000000       1.710000e+02     0.000000     0.440000
25%    2011.000000       3.400000e+04     5.000000     3.500000
50%    2014.000000       5.300000e+04     5.000000     5.640000
75%    2016.000000       7.300000e+04     5.000000     9.950000
max    2019.000000       6.500000e+06    10.000000   160.000000

In [5]:
data.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  42
New_Price            5195
Price                   0
dtype: int64

In [6]:
data.drop('New_Price' , axis=1 , inplace=True)

In [7]:
round(data.isna().mean()*100 ,2)

Name                 0.00
Location             0.00
Year                 0.00
Kilometers_Driven    0.00
Fuel_Type            0.00
Transmission         0.00
Owner_Type           0.00
Mileage              0.03
Engine               0.60
Power                0.60
Seats                0.70
Price                0.00
dtype: float64

In [8]:
data.dropna(inplace=True)

In [9]:
round(data.isna().mean()*100 ,2)

Name                 0.0
Location             0.0
Year                 0.0
Kilometers_Driven    0.0
Fuel_Type            0.0
Transmission         0.0
Owner_Type           0.0
Mileage              0.0
Engine               0.0
Power                0.0
Seats                0.0
Price                0.0
dtype: float64

In [10]:
data.columns

Index(['Name', 'Location', 'Year', 'Kilometers_Driven', 'Fuel_Type',
       'Transmission', 'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats',
       'Price'],
      dtype='object')

In [11]:
data.Name.value_counts()

Mahindra XUV500 W8 2WD           49
Maruti Swift VDI                 45
Honda City 1.5 S MT              34
Maruti Swift Dzire VDI           34
Maruti Swift VDI BSIV            31
                                 ..
Ford Fiesta Titanium 1.5 TDCi     1
Mahindra Scorpio S10 AT 4WD       1
Hyundai i20 1.2 Era               1
Toyota Camry W4 (AT)              1
Mahindra Xylo D4 BSIV             1
Name: Name, Length: 1855, dtype: int64

In [12]:
data.Location.value_counts()

Mumbai        784
Hyderabad     741
Kochi         648
Coimbatore    634
Pune          613
Delhi         549
Kolkata       530
Chennai       490
Jaipur        410
Bangalore     353
Ahmedabad     223
Name: Location, dtype: int64

In [13]:
data.Year.value_counts()

2014    795
2015    741
2016    740
2013    648
2017    586
2012    572
2011    461
2010    339
2018    298
2009    196
2008    169
2007    123
2019    102
2006     75
2005     55
2004     29
2003     15
2002     14
2001      7
2000      4
1998      4
1999      2
Name: Year, dtype: int64

In [14]:
data.Fuel_Type.value_counts

<bound method IndexOpsMixin.value_counts of 0          CNG
1       Diesel
2       Petrol
3       Diesel
4       Diesel
         ...
6014    Diesel
6015    Diesel
6016    Diesel
6017    Petrol
6018    Diesel
Name: Fuel_Type, Length: 5975, dtype: object>

In [15]:
data.Owner_Type.value_counts()

First             4903
Second             953
Third              111
Fourth & Above       8
Name: Owner_Type, dtype: int64

In [16]:
categorical_col=data.select_dtypes(include='object')
for col in categorical_col:
    print(data[col].value_counts())
    print('*'*100)

Mahindra XUV500 W8 2WD           49
Maruti Swift VDI                 45
Honda City 1.5 S MT              34
Maruti Swift Dzire VDI           34
Maruti Swift VDI BSIV            31
                                 ..
Ford Fiesta Titanium 1.5 TDCi     1
Mahindra Scorpio S10 AT 4WD       1
Hyundai i20 1.2 Era               1
Toyota Camry W4 (AT)              1
Mahindra Xylo D4 BSIV             1
Name: Name, Length: 1855, dtype: int64
****************************************************************************************************
Mumbai        784
Hyderabad     741
Kochi         648
Coimbatore    634
Pune          613
Delhi         549
Kolkata       530
Chennai       490
Jaipur        410
Bangalore     353
Ahmedabad     223
Name: Location, dtype: int64
****************************************************************************************************
Diesel    3195
Petrol    2714
CNG         56
LPG         10
Name: Fuel_Type, dtype: int64
****************************************************************************************************
Manual       4266
Automatic    1709
Name: Transmission, dtype: int64
****************************************************************************************************
First             4903
Second             953
Third              111
Fourth & Above       8
Name: Owner_Type, dtype: int64
****************************************************************************************************
18.9 kmpl     172
17.0 kmpl     170
18.6 kmpl     119
20.36 kmpl     88
21.1 kmpl      86
             ...
14.57 kmpl      1
14.33 kmpl      1
22.8 km/kg      1
8.0 kmpl        1
17.24 kmpl      1
Name: Mileage, Length: 442, dtype: int64
****************************************************************************************************
1197 CC    606
1248 CC    512
1498 CC    303
998 CC     259
2179 CC    240
          ...
1489 CC      1
1422 CC      1
1978 CC      1
2694 CC      1
1797 CC      1
Name: Engine, Length: 145, dtype: int64
****************************************************************************************************
74 bhp        235
98.6 bhp      131
73.9 bhp      125
140 bhp       123
78.9 bhp      111
             ...
201 bhp         1
199.3 bhp       1
95 bhp          1
152.88 bhp      1
181.04 bhp      1
Name: Power, Length: 371, dtype: int64
****************************************************************************************************

In [17]:
data.sample(3)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
3315,Maruti Ertiga VDI,Pune,2012,168000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,4.50
5708,Honda BRV i-VTEC V CVT,Mumbai,2017,16503,Petrol,Automatic,First,16.0 kmpl,1497 CC,117.3 bhp,7.0,9.50
1372,Hyundai Creta 1.6 VTVT E Plus,Bangalore,2017,26246,Petrol,Manual,First,15.29 kmpl,1591 CC,121.3 bhp,5.0,10.75

In [18]:
data['Brand']=data.Name.str.split(' ').str[0]
data['Model']=data.Name.str.split(' ').str[1]

In [19]:
data.sample(3)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Brand,Model
3616,Maruti Ertiga ZDI,Chennai,2015,40000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.8 bhp,7.0,8.25,Maruti,Ertiga
3307,Toyota Etios Liva GD,Delhi,2013,64000,Diesel,Manual,First,23.59 kmpl,1364 CC,67.06 bhp,5.0,3.10,Toyota,Etios
3019,Honda City i DTEC V,Ahmedabad,2015,77000,Diesel,Manual,First,26.0 kmpl,1498 CC,98.6 bhp,5.0,6.98,Honda,City

In [20]:
data.drop('Name',axis=1 , inplace=True)

In [21]:
data['Owner_Type']=data['Owner_Type'].map({'First':1 , 'Second':2 , 'Third':3 ,'Fourth & Above':4})

In [22]:
data['Engine']=data['Engine'].str.split(' ').str[0]
data['Power']=data['Power'].str.split(' ').str[0]

In [23]:
data.head()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Brand,Model
0,Mumbai,2010,72000,CNG,Manual,1,26.6 km/kg,998,58.16,5.0,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,1,19.67 kmpl,1582,126.2,5.0,12.50,Hyundai,Creta
2,Chennai,2011,46000,Petrol,Manual,1,18.2 kmpl,1199,88.7,5.0,4.50,Honda,Jazz
3,Chennai,2012,87000,Diesel,Manual,1,20.77 kmpl,1248,88.76,7.0,6.00,Maruti,Ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,2,15.2 kmpl,1968,140.8,5.0,17.74,Audi,A4

In [24]:
def convert_mileage(mileage):
    try:
        new_mileage=float(mileage.split(" ")[0])
        if mileage.split(" ")[1]=='km/kg':
            new_mileage=new_mileage*0.74
            return new_mileage   
    except:
        return np.nan

In [25]:
data['Mileage']=data['Mileage'].apply(convert_mileage)

In [26]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5975 entries, 0 to 6018
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Location           5975 non-null   object
 1   Year               5975 non-null   int64
 2   Kilometers_Driven  5975 non-null   int64
 3   Fuel_Type          5975 non-null   object
 4   Transmission       5975 non-null   object
 5   Owner_Type         5975 non-null   int64
 6   Mileage            66 non-null     float64
 7   Engine             5975 non-null   object
 8   Power              5975 non-null   object
 9   Seats              5975 non-null   float64
 10  Price              5975 non-null   float64
 11  Brand              5975 non-null   object
 12  Model              5975 non-null   object
dtypes: float64(3), int64(3), object(7)
memory usage: 653.5+ KB

In [27]:
data.dtypes

Location              object
Year                   int64
Kilometers_Driven      int64
Fuel_Type             object
Transmission          object
Owner_Type             int64
Mileage              float64
Engine                object
Power                 object
Seats                float64
Price                float64
Brand                 object
Model                 object
dtype: object

In [28]:
data.sample()

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price,Brand,Model
1614,Hyderabad,2012,60788,Diesel,Manual,1,NaN,1396,90,5.0,4.5,Hyundai,i20

In [29]:
data['Power']=pd.to_numeric(data['Power'],errors='coerce')

In [30]:
data['Engine']=pd.to_numeric(data['Engine'],errors='coerce')

In [31]:
# change float format
pd.options.display.float_format = '{:.2f}'.format
data.describe()

,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price
count,5975.00,5975.00,5975.00,66.00,5975.00,5872.00,5975.00,5975.00
mean,2013.39,58674.31,1.20,18.13,1621.61,113.28,5.28,9.50
std,3.25,91558.51,0.45,4.60,601.04,53.88,0.81,11.21
min,1998.00,171.00,1.00,9.77,624.00,34.20,0.00,0.44
25%,2012.00,33908.00,1.00,14.36,1198.00,75.00,5.00,3.50
50%,2014.00,53000.00,1.00,19.39,1493.00,97.70,5.00,5.65
75%,2016.00,73000.00,1.00,19.68,1984.00,138.10,5.00,9.95
max,2019.00,6500000.00,4.00,24.82,5998.00,560.00,10.00,160.00

In [32]:
data.drop(data[data['Kilometers_Driven']>100000].index , axis=0 , inplace=True)
data.drop(data[data['Power'] > 480].index, axis = 0, inplace = True)
data.drop(data[data['Engine'] > 5000].index, axis = 0, inplace = True)

In [33]:
# change float format
pd.options.display.float_format = '{:.2f}'.format
data.describe()

,Year,Kilometers_Driven,Owner_Type,Mileage,Engine,Power,Seats,Price
count,5463.00,5463.00,5463.00,66.00,5463.00,5380.00,5463.00,5463.00
mean,2013.66,50031.60,1.18,18.13,1591.31,112.59,5.24,9.70
std,3.08,23291.58,0.43,4.60,574.10,52.39,0.75,11.27
min,1998.00,171.00,1.00,9.77,624.00,34.20,2.00,0.44
25%,2012.00,32000.00,1.00,14.36,1197.00,75.00,5.00,3.55
50%,2014.00,50000.00,1.00,19.39,1461.00,91.20,5.00,5.75
75%,2016.00,67000.00,1.00,19.68,1968.00,138.10,5.00,10.00
max,2019.00,100000.00,4.00,24.82,4951.00,450.00,10.00,160.00

In [34]:
# Data Splitting
#X = df.drop('Price', axis=1)
X = data.drop(['Price', 'Brand'], axis=1)

y = data.Price

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

In [35]:
data.columns

Index(['Location', 'Year', 'Kilometers_Driven', 'Fuel_Type', 'Transmission',
       'Owner_Type', 'Mileage', 'Engine', 'Power', 'Seats', 'Price', 'Brand',
       'Model'],
      dtype='object')

In [36]:
# Data Preprocessing
from category_encoders import BinaryEncoder
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import StandardScaler
from sklearn.pipeline import Pipeline
from sklearn.compose import ColumnTransformer

# Preprocessing for numerical data
numerical_transformer = Pipeline(steps=[
    ('imputer', SimpleImputer(strategy='median')),
    ('scaler', StandardScaler())])

# Preprocessing for categorical data
categorical_transformer = Pipeline(steps=[('binary', BinaryEncoder())])

# Bundle preprocessing for numerical and categorical data
preprocessor = ColumnTransformer(
    transformers=[
        ('num', numerical_transformer, ['Year', 'Kilometers_Driven', 'Mileage', 'Engine', 'Power', 'Seats']),
        ('cat', categorical_transformer, ['Location', 'Fuel_Type', 'Transmission', 'Owner_Type', 'Model'])])

X_train_preprocessed = preprocessor.fit_transform(X_train)
X_test_preprocessed = preprocessor.transform(X_test)

In [37]:
# Model Building
from sklearn.linear_model import LinearRegression

# Linear Regression
lr = LinearRegression()
lr.fit(X_train_preprocessed, y_train)

# Model Evaluation
from sklearn.metrics import mean_squared_error, r2_score

# Predictions
y_pred = lr.predict(X_test_preprocessed)

# Model Evaluation
print('RMSE:', np.sqrt(mean_squared_error(y_test, y_pred)))
print('R2:', r2_score(y_test, y_pred))

RMSE: 5.191115391451057
R2: 0.7693261756988365

In [38]:
# Ridge Regression
from sklearn.linear_model import Ridge
ridge=Ridge()
ridge.fit(X_train_preprocessed, y_train)

y_pred=ridge.predict(X_test_preprocessed)

print('RMSE:', np.sqrt(mean_squared_error(y_test, y_pred)))
print('R2:', r2_score(y_test, y_pred))

RMSE: 5.190733265399747
R2: 0.7693601349644952

In [39]:
#polynomial regression
from sklearn.preprocessing import PolynomialFeatures
from sklearn.pipeline import make_pipeline

poly=make_pipeline(PolynomialFeatures(2),Ridge())
poly.fit(X_train_preprocessed, y_train)

y_pred=poly.predict(X_test_preprocessed)

print('RMSE:', np.sqrt(mean_squared_error(y_test, y_pred)))
print('R2:', r2_score(y_test, y_pred))

RMSE: 3.298387200471713
R2: 0.9068720113604614

In [40]:
def log_transform(x):
    return np.log(x)
y_train_log=log_transform(y_train)
y_test_log=log_transform(y_test)

# Linear Regression
lr = LinearRegression()
lr.fit(X_train_preprocessed,y_train_log)

y_pred = lr.predict(X_test_preprocessed)

print('RMSE:', np.sqrt(mean_squared_error(y_test_log, y_pred)))
print('R2:', r2_score(y_test_log, y_pred))

RMSE: 0.2851374601659795
R2: 0.8930012610506187

In [47]:
poly=make_pipeline(PolynomialFeatures(2),Ridge())
poly.fit(X_train_preprocessed,y_train_log)

y_pred=poly.predict(X_test_preprocessed)

print('RMSE:', np.sqrt(mean_squared_error(y_test, y_pred)))
print('R2:', r2_score(y_test_log, y_pred))

RMSE: 12.672072024938505
R2: 0.933675762365308

In [48]:
# Preprocessor Saving
import pickle
pickle.dump(preprocessor, open('preprocessor.pkl', 'wb'))

# Model Saving
pickle.dump(poly, open('model.pkl', 'wb'))

In [49]:
# Inferencing

# Load Preprocessor
preprocessor = pickle.load(open('preprocessor.pkl', 'rb'))
model = pickle.load(open('model.pkl', 'rb'))

In [50]:
# Preprocessing
new_data = {'Location': 'Mumbai', 'Year': 2017, 'Kilometers_Driven': 72000, 'Fuel_Type': 'Diesel', 'Transmission': 'Manual', 'Owner_Type': 'First', 'Mileage': 25.0, 'Engine': 1248, 'Power': 74.0, 'Seats': 5.0, 'Model': 'Swift'}
new_data = pd.DataFrame(new_data, index=[0])
new_data.Owner_Type = new_data.Owner_Type.map({'First':1, 'Second':2, 'Third':3, 'Fourth & Above':4})
new_data

,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Model
0,Mumbai,2017,72000,Diesel,Manual,1,25.00,1248,74.00,5.00,Swift

In [51]:
# Prediction
new_data_preprocessed = preprocessor.transform(new_data)
log_price = model.predict(new_data_preprocessed) # in log scale
price = np.exp(log_price) # in original scale

print('Price:', price[0])

Price: 5.585889363459736

In [52]:
# From Lakhs to USD
price_usd = price[0] * 1219
print('Price in USD:', price_usd)

Price in USD: 6809.199134057418